#include "solution.cpp"
#include <utility>

// {10, 40, 30, 10, 30, 20},
// {30, 20, 10, 30, 20, 40},
// {20, 30, 30, 20, 30, 10},
//
// pq:
// {10, (0, 0)}, {10, (3, 0)}, {10, (2, 5)}
// {20, (0, 5)}, {20, (2, 0)}, {20, (2, 3)}
// {30, (0, 2)}, {30, (0, 4)}, {30, (1, 0)}, {30, (2, 1)}, {30, (2, 2)}, {30, (2, 4)}
// {40, (0, 1)}, {40, (1, 5)}
// 
// pq -> {10, (0, 0)}
// pq <- {30, (1, 0)}, {40, (0, 1)} (이미 방문함)
// pq -> {10, (3, 0)}
// pq <- {30, (0, 2)}, {30, (0, 4)} (이미 방문함)
// pq <- {30, (3, 1)}
int main()
{
    auto s = Solution();

    vector<pair<vector<vector<int>>, int>> cases;
    cases.emplace_back(
        vector<vector<int>>{
            {10, 40, 30, 10, 30, 20},
            {30, 20, 10, 30, 20, 40},
            {20, 30, 30, 20, 30, 10},
        },
        40);
    cases.emplace_back(
        vector<vector<int>>{
            {12, 13, 1, 12},
            {13, 4, 13, 12},
            {13, 8, 10, 12},
            {12, 13, 12, 12},
            {13, 13, 13, 13},
        },
        14);
    cases.emplace_back(
        vector<vector<int>>{
            {9, 9, 9, 9, 9},
            {9, 2, 1, 2, 9},
            {9, 2, 8, 2, 9},
            {9, 1, 2, 4, 9},
            {9, 9, 9, 9, 9},
        },
        57);
    cases.emplace_back(
        vector<vector<int>>{
            {3, 3, 4, 4, 4, 2},
            {3, 1, 3, 2, 1, 4},
            {7, 3, 1, 6, 4, 1},
        },
        5);

    for (auto &c : cases)
    {
        auto ans = s.trapRainWater(c.first);
        cout << "[RESULT]" << ans << " == " << c.second << endl << endl;
    }
}
